# План тестирования

## Цель

Проверить корректность работы основных функций интернет-магазина SauceDemo перед выпуском новой версии.

---

## Объект тестирования

Веб-приложение SauceDemo.

---

## Что тестируется

- Авторизация
- Выход из аккаунта
- Каталог товаров
- Сортировка
- Добавление товара в корзину
- Удаление товара
- Корзина
- Оформление заказа
- Навигация

---

## Что НЕ тестируется

- Производительность
- Безопасность
- Серверная часть
- Платежная система

---

## Виды тестирования

- Функциональное
- Smoke
- Регрессионное
- UI
- Исследовательское
- Совместимость
- Негативное
- Граничные значения

---

## Критерии начала тестирования

- Сайт доступен.
- Подготовлены тестовые данные.
- Используется актуальная версия браузера.

---

## Критерии окончания тестирования

- Выполнены все тест-кейсы.
- Все критические ошибки устранены.
- Подготовлен итоговый отчет.

---

## Возможные риски

- Ошибки отображения в разных браузерах.
- Потеря интернет-соединения.
- Некорректный ввод пользователем данных.

---

## Артефакты

- План тестирования
- Тест-кейсы
- Чек-листы
- Баг-репорты
- Итоговый отчет
